src/InformationRegisters/ОграничениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортиментаПодразделения</Name>
			<Comment>Ограничение ассортимента подразделения компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Comment>Товар вводится в базовый ассортимент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>итФорматАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОграничениеАссортиментаПодразделения/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Ограничение ассортимента подразделения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт;               // Документ объект
Перем ПодразделениеКомпании Экспорт;		// Подразделение компании
Перем ДатаИзмененияАссортимента Экспорт;    // Дата изменения ассортимента
Перем РезультатЗапросаПоТоварам Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
Перем ОперацияСАссортиментом Экспорт;       // Операция с ассортиментом
//Мальцев А.Ю. +++
Перем ФорматАссортимента Экспорт;
//Мальцев А.Ю. ---

// ускоряющие переменные
Перем ВалютаДокумента, КурсДокумента, ВалютаРеглУчета, КурсРеглВалюты;

#КонецОбласти

// Функция установки ассортимента
Функция УстановитьАссортимент() Экспорт
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	
	// ускоряющие переменные
	ВалютаДокумента	= ДокументОбъект.ВалютаДокумента;
	КурсДокумента	= ДокументОбъект.КурсДокумента;
	ВалютаРеглУчета	= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КурсРеглВалюты	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРеглУчета, ДокументОбъект.МоментВремени()).Курс;
	
	ЭтоДокументИзменениеАссортиментаПодразделения = ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ИзменениеАссортиментаПодразделения");
	
	Для Каждого СтрокаТовар Из РезультатЗапросаПоТоварам Цикл
		ЦенаРозничная = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаТовар.ЦенаРозничная,ВалютаДокумента,КурсДокумента,ВалютаРеглУчета,КурсРеглВалюты);
		
		НоваяЗапись	= Добавить();
		НоваяЗапись.Период					= ДатаИзмененияАссортимента;
		НоваяЗапись.Регистратор				= ДокументОбъект.Ссылка;
		НоваяЗапись.ПодразделениеКомпании	= ПодразделениеКомпании;
		НоваяЗапись.Номенклатура			= СтрокаТовар.Номенклатура;
		НоваяЗапись.Состояние				= ОперацияСАссортиментом;
		НоваяЗапись.Цена					= СтрокаТовар.Цена;
		НоваяЗапись.ПроцентНаценки			= СтрокаТовар.ПроцентНаценки;
		НоваяЗапись.ЦенаРозничная			= ЦенаРозничная;
		НоваяЗапись.СтавкаНДС				= СтрокаТовар.СтавкаНДС;
		НоваяЗапись.БазовыйАссортимент		= СтрокаТовар.БазовыйАссортимент;
		Если ЭтоДокументИзменениеАссортиментаПодразделения Тогда
			НоваяЗапись.ВидАссортимента			= СтрокаТовар.ВидАссортимента;
		КонецЕсли;
		
		//Мальцев А.Ю. +++		
		НоваяЗапись.итФорматАссортимента 	= ФорматАссортимента; 
		//Мальцев А.Ю. ---
		
	КонецЦикла;
	
	// скинем некоторые переменные
	РезультатЗапросаПоТоварам = Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект = Неопределено;
	
	Возврат Истина;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
